Revit 2027 API
Hub.GetOrigin Method
 Retrieves position of a Hub if such position is a 3D point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetOrigin()
Public Function GetOrigin As XYZ
public:
XYZ^ GetOrigin()
member GetOrigin : unit -> XYZ
Return Value
XYZ
 The origin.
Exceptions
Exception | Condition
InvalidOperationException |  Hub does not have an Origin.
See Also
Reference
Hub Class
Autodesk.Revit.DB.Structure Namespace